app/views/events/show.html.erb

		 <% @rsvpusers.each do |rsvpuser| %>
			 <%= link_to rsvpuser.name, rsvpuser %>,
			 <% nguests = Rsvpq.where("user_id = ? AND event_id = ?", rsvpuser.id, @event.id) %>
---
SELECT "rsvpqs".* FROM "rsvpqs" WHERE "rsvpqs"."event_id" = $1  [["event_id", 4]]