app/views/events/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "rsvpqs" ON "users"."id" = "rsvpqs"."user_id" WHERE "rsvpqs"."event_id" = $1  [["event_id", 4]]
---
      <div style ="margin-left: 30px">
        <% if @displayconvo.present? && @displayconvo.user_id == @user.id %>