app/controllers/embed_links_controller.rb

INSERT INTO "embed_links" ("border", "border_color", "border_size", "size", "location", "special_position", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @embed_link = EmbedLink.new(embed_link_params)

    if @embed_link.save

SELECT "embed_links".* FROM "embed_links" WHERE "embed_links"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_embed_link
      @embed_link = EmbedLink.find(params[:id])