app/controllers/events_controller.rb

  def show
    @event     = Event.find(params[:id])
    @user      = User.find(@event.usrid)
---
SELECT "events".* FROM "events" WHERE (start_at < '2020-08-20 13:15:58.566192' AND end_at > '2020-08-20 13:15:58.566192' AND user_id = 2) ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create

    convert_time # call convert time method
    @event = current_user.events.build(event_params)
    @event.update_attribute(:user_id, params[:event][:usrid])
    user = User.find(@event.usrid)
    offset = -1 * Time.now.in_time_zone("Pacific Time (US & Canada)").gmt_offset/3600
    reminder_hour = @event.start_at + offset.hours - 1.hours
    @reminder_date = @event.start_at - 1.days #why is the scope beyond local? Do we use this variable in a view? I doubt it.
    respond_to do |format|
      if @event.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("name", "start_at", "end_at", "created_at", "updated_at", "desc", "user_id", "topic") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"