app/controllers/merchandises_controller.rb

  def show
    @author = User.find(@merchandise.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @merchandise = current_user.merchandises.build(merchandise_params)
    cost = Merchandise.find(params[:id]).price
    if cost.to_i != 0
      @merchandise.save
---
INSERT INTO "merchandises" ("name", "user_id", "price", "desc", "itempic", "created_at", "updated_at", "deadline", "youtube", "buttontype") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @merchandise = Merchandise.find(params[:id])
---
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_merchandise
      @merchandise = Merchandise.find(params[:id])
      @user = User.find(@merchandise.user_id)
      @expiredmerch = @user.merchandises.where("deadline < ?", Date.today)
---
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."user_id" = $1 AND (deadline > '2020-08-20' OR deadline IS NULL) ORDER BY "merchandises"."deadline" ASC  [["user_id", 1]]