app/controllers/purchases_controller.rb

SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    if(params[:pricesold].present?) # Donation being made
      @purchase = Purchase.new
    elsif(params[:merchandise_id].present?) #Purchase being made
      @merchandise = Merchandise.find(params[:merchandise_id])