app/controllers/rsvpqs_controller.rb

  def create
    if current_user
      @rsvp = current_user.rsvpqs.build(rsvpq_params)
    else
      @rsvp = Rsvpq.new(rsvpq_params)
    end

    if @rsvp.save
      flash[:success] = 'Rsvp was successfully created.'
      @event = Event.find(params[:rsvpq][:event_id])
      offset = -1 * Time.now.in_time_zone("Pacific Time (US & Canada)").gmt_offset/3600
      @reminder_date = @event.start_at + offset.hours - 1.hours #why is the scope Instance instead of local??? Where else is this needed?
      @email = params[:rsvpq][:email] #why is the scope Instance instead of local??? Where else is this needed?
      if current_user
        RsvpMailer.with(user: current_user, event: @event, timeZone: params[:timeZone]).rsvp_reminder.deliver_later(wait_until: @reminder_date)
      else
        RsvpMailer.with(email: @email, event: @event, timeZone: params[:timeZone]).rsvp_reminder.deliver_later(wait_until: @reminder_date)
---
INSERT INTO "rsvpqs" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["user_id", 1], ["created_at", "2020-08-20 19:47:52.639782"], ["updated_at", "2020-08-20 19:47:52.639782"]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "rsvpqs".* FROM "rsvpqs" WHERE "rsvpqs"."email" IS NULL LIMIT $1  [["LIMIT", 1]]