app/controllers/static_pages_controller.rb

SELECT "events".* FROM "events" WHERE (start_at < '2020-08-17 14:49:12.801067' AND start_at > '2020-08-17 13:49:12.801086' AND topic = 'Conversation') ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "events" WHERE (start_at > '2020-08-17 11:49:12.786859' AND topic = 'Conversation')
---
  def home
    showrecentconvo = Time.now - 10.hours
    @conversations = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' )
    @conversationsall = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' ) #is this used?

    @events = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' ).order('start_at ASC').paginate(page: params[:page], :per_page => 9)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      @description = @displayconvo.desc
      @start_time = @displayconvo.start_at.strftime("%B %d %Y") + ' ' + @displayconvo.start_at.strftime("%T") + " PDT"
      @end_time = @displayconvo.end_at.strftime("%B %d %Y") + ' ' + @displayconvo.end_at.strftime("%T") + " PDT"
      @host = User.find(@displayconvo.user_id)

SELECT "events".* FROM "events" WHERE (start_at < '2020-10-24 17:00:26.696451' AND start_at > '2020-10-24 16:00:26.696527' AND topic = 'Conversation') ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "events" WHERE (start_at > '2020-10-24 14:43:50.676562' AND topic = 'Conversation')
---
  def embed
    showrecentconvo = Time.now - 10.hours
    @conversations = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' )
    @conversationsall = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' ) #is this used?

    @events = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' ).order('start_at ASC').paginate(page: params[:page], :per_page => 9)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      @description = @displayconvo.desc
      @start_time = @displayconvo.start_at.strftime("%B %d %Y") + ' ' + @displayconvo.start_at.strftime("%T") + " PDT"
      @end_time = @displayconvo.end_at.strftime("%B %d %Y") + ' ' + @displayconvo.end_at.strftime("%T") + " PDT"
      @host = User.find(@displayconvo.user_id)

SELECT "events".* FROM "events" WHERE (start_at < '2020-10-25 17:25:25.222572' AND start_at > '2020-10-25 16:25:25.222608' AND topic = 'Conversation') ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE (start_at > '2020-10-25 14:30:58.133455' AND topic = 'Conversation') LIMIT $1  [["LIMIT", 11]]
---
  def calendar_view
    showrecentconvo = Time.now - 10.hours
    @conversations = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' )
    @conversationsall = Event.where( "start_at > ? AND topic = ?", showrecentconvo, 'Conversation' ) #is this used?

    @events = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' ).order('start_at ASC').paginate(page: params[:page], :per_page => 9)

SELECT "events".* FROM "events" WHERE (start_at > '2020-10-24 16:20:33.810992' AND topic = 'Conversation') ORDER BY start_at ASC
---
  def monthCalendar
    @monthNum = params[:monthNum].to_i
    @type = params[:type].to_i
    currentTime = Time.now - 10.hour

    unless @monthNum.month == 0
      @selectedMonth = currentTime.beginning_of_month + @monthNum.month
    else
      @selectedMonth = currentTime.to_date
    end
    if @type == 0
      conversations = Event.where( "start_at > ? AND topic = ?", currentTime, 'Conversation' ).order('start_at ASC')

SELECT "events".* FROM "events" WHERE (start_at < '2020-08-17 14:49:37.440940' AND start_at > '2020-08-17 13:49:37.440959' AND (topic = 'DropIn')) ORDER BY start_at ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "events" WHERE (start_at > '2020-08-17 11:49:37.438928' AND (topic = 'DropIn' OR topic = 'Group Problem Solving'))
---
  def studyhall
    showrecentconvo = Time.now - 10.hours

    @events = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' )
    @eventsAll = Event.where( "start_at > ? AND (topic = ? OR topic = ?)", showrecentconvo, 'DropIn', 'Group Problem Solving' )
    @monthforCalendar = Date.today
    @calendar_events = @events.flat_map{ |e| e.calendar_events(e.start_at)}
    @calendar_events = @calendar_events.sort_by {|event| event.start_at}
    @calendar_events_all = @calendar_events
    @calendar_events = @calendar_events.paginate(page: params[:page], :per_page => 9)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      @descriptionstudy = @displaystudy.desc
      @start_timestudy = @displaystudy.start_at.strftime("%B %d %Y") + ' ' + @displaystudy.start_at.strftime("%T") + " PDT"
      @end_timestudy = @displaystudy.end_at.strftime("%B %d %Y") + ' ' + @displaystudy.end_at.strftime("%T") + " PDT"
      @hoststudy = User.find(@displaystudy.user_id)