app/controllers/users_controller.rb

  def show
    # @redirecturl = "https://connect.stripe.com/oauth/authorize?response_type=code&client_id=" + STRIPE_CONNECT_CLIENT_ID + "&scope=read_write"
    pdtnow = Time.now - 7.hours + 5.minutes
    id = @user.id
    currconvo = Event.where("start_at < ? AND end_at > ? AND usrid = ?", Time.now, Time.now, id ).first
---
SELECT "events".* FROM "events" WHERE (start_at < '2020-08-18 14:20:45.775841' AND end_at > '2020-08-18 14:20:45.775841' AND user_id = 1) ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def controlpanel
    @user.calcdashboard
    @monthperkinfo = @user.monthperkinfo
    @monthbookinfo = @user.monthbookinfo
    @incomeinfo = @user.incomeinfo
    @salebyfiletype = @user.salebyfiletype
    @salebyperktype = @user.salebyperktype
    @totalinfo = @user.totalinfo
    @purchasesinfo = @user.purchasesinfo

    currtime = Time.now
    rsvps = Event.where('id IN (SELECT event_id FROM rsvpqs WHERE rsvpqs.user_id = ?)', @user.id)
    @rsvpevents = rsvps.where( "start_at > ?", currtime )
    @events = Event.where( "start_at > ? AND usrid = ?", currtime, @user.id )
    respond_to do |format|
      format.html
      format.json { render json: @user }
    end
    @pastevents = Event.where( "start_at < ? AND usrid = ?", currtime, @user.id )
    rsvps = Event.where('id IN (SELECT event_id FROM rsvpqs WHERE rsvpqs.user_id = ?)', @user.id)
    @pastrsvps = rsvps.where( "start_at < ?", currtime )
    respond_to do |format|
      format.html
      format.json { render json: @user }
    end
    if @user.merchandises.any?
      expiredmerch = @user.merchandises.where("deadline < ?", Date.today)
---
SELECT "events".* FROM "events" WHERE (start_at > '2020-08-18 21:15:46.142373' AND user_id = 1)
SELECT "purchases".* FROM "purchases" WHERE (purchases.author_id = 1) ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."user_id" = $1 AND (deadline < '2020-08-20') ORDER BY deadline ASC  [["user_id", 1]]
SELECT 1 AS one FROM "merchandises" WHERE "merchandises"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."user_id" = $1 AND (deadline >= '2020-08-20' OR deadline IS NULL) ORDER BY "merchandises"."deadline" ASC  [["user_id", 1]]

  def stripe_callback
    options = {
      site: 'https://connect.stripe.com',
      authorize_url: '/oauth/authorize',
      token_url: '/oauth/token'
    }
    code = params[:code]
    if Rails.env.development? || Rails.env.test?
      client = OAuth2::Client.new(STRIPE_CONNECT_CLIENT_ID, STRIPE_SECRET_KEY, options)
    else
      client = OAuth2::Client.new(ENV['STRIPE_CONNECT_CLIENT_ID'], ENV['STRIPE_SECRET_KEY'], options)
    end

    @resp = client.auth_code.get_token(code, :params => {:scope => 'read_write'})
    @access_token = @resp.token
    current_user.update!(stripeid: @resp.params["stripe_user_id"]) if @resp
---
UPDATE "users" SET "stripeid" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["stripeid", "acct_1HIL4GDJfYxJXeEH"], ["updated_at", "2020-08-21 18:57:50.182354"], ["id", 1]]

  def create
    @user = User.new(user_params)
    #    @user.latitude = request.location.latitude #geocoder has become piece of junk
    #    @user.longitude = request.location.longitude
    if @user.save
---
INSERT INTO "users" ("name", "email", "author", "created_at", "updated_at", "encrypted_password", "permalink", "confirmation_token", "confirmation_sent_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "about" = $1, "genre1" = $2, "genre2" = $3, "genre3" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["about", "this is it"], ["genre1", ""], ["genre2", ""], ["genre3", ""], ["updated_at", "2020-08-18 23:21:15.636870"], ["id", 1]]

  def set_user
    @user = User.find_by_permalink(params[:permalink]) || current_user
    if @user.merchandises.any?
      notexpiredmerch = @user.merchandises.where("deadline >= ? OR deadline IS NULL", Date.today)
---
SELECT "users".* FROM "users" WHERE "users"."permalink" = $1 LIMIT $2  [["permalink", "favicon"], ["LIMIT", 1]]
SELECT 1 AS one FROM "merchandises" WHERE "merchandises"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."permalink") = LOWER($1) AND "users"."id" != $2 LIMIT $3  [["permalink", "testuser"], ["id", 2], ["LIMIT", 1]]
SELECT "merchandises".* FROM "merchandises" WHERE "merchandises"."user_id" = $1 AND (deadline >= '2020-08-24' OR deadline IS NULL) ORDER BY "merchandises"."deadline" ASC  [["user_id", 1]]