app/views/layouts/_authorform.html.erb

          <li><%= link_to @user.followers.count.to_s + " followers", user_followerspage_path(@user.permalink), class: 'link-to-text' %> </li>
          <li><%= render '/users/follow_form', :user => User.find_by_permalink(params[:permalink]) %> </li>
---
SELECT "users".* FROM "users" WHERE "users"."permalink" = $1 LIMIT $2  [["permalink", "test1"], ["LIMIT", 1]]