app/views/layouts/_convocalendar.html.erb

      <% @calendar_events.sort_by{|t| t.start_at}.each do |event| %>
          <% user = User.find(event.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

                    <% flag = true %>
                    <% event.rsvpqs.each do |rsvp| %>
---
SELECT "rsvpqs".* FROM "rsvpqs" WHERE "rsvpqs"."event_id" = $1  [["event_id", 2]]