app/views/layouts/_maincalendar.html.erb

      <% @calendar_events.sort_by{|t| t.start_at}.each do |event| %>
        <% user = User.find(event.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

                    <% flag = true %>
                    <% event.rsvpqs.each do |rsvp| %>
---
SELECT "rsvpqs".* FROM "rsvpqs" WHERE "rsvpqs"."event_id" = $1  [["event_id", 4]]