app/views/layouts/_renderday.html.erb

            <%eventCount += 1%>
            <% user = User.find(event.usrid) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

                        <% flag = true %>
                        <% event.rsvpqs.each do |rsvp| %>
---
SELECT "rsvpqs".* FROM "rsvpqs" WHERE "rsvpqs"."event_id" = $1  [["event_id", 1]]